Q1. What is a database? Differentiate between SQL and NoSQL databases.

In [ ]:
Ans:-Database is a system that allows users to store & organize data.
       SQL:-
         i.It ia a relational database
          ii.Data store in the form of tables(rows & columns)
            iii.Low efficieny with high volumes of data.
            
        NOSQL:-
          i.It is a non-relational database
            ii.Data store either key-values pairs,documents-based & graph database
              iii.They are dynamic schema
                iv.Easily work with huge volumes of data.

Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

In [ ]:
Ans:-DDL stands for Data Definition Language which is used to manipulate the structure database
      
i.CREATE:-
    The CREATE statement is used to create new database objects, such as tables, views, indexes, or schemas.
  
 ex---
CREATE TABLE Employees (
    ID INT PRIMARY KEY,
    Name VARCHAR(30),
    Age INT,
    Department VARCHAR(30)
);            

ii.DROP:-
       The DROP statement is used to delete existing database objects, such as tables, views, or indexes.
    ex---
DROP TABLE Employees;

iii.ALTER:-
        The ALTER statement is used to modify the structure of an existing database object.
    ex---
ALTER TABLE Employees
ADD COLUMN Salary DECIMAL(20, 8);

iv.TRUNCATE:-
   ex---
TRUNCATE TABLE Employees;

Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.

In [ ]:
Ans:-
    DML stands for Data Manipulkation Language which is used to retrieve, insert, update, and delete data within a database.
i.INSERT:-
      The INSERT statement is used to insert new rows of data into a table. 
    ex--
INSERT INTO Employees (ID, Name, Age, Department)
VALUES (1, 'Daniel Joe', 35, 'Marketing');

ii.UPDATE:-
       The UPDATE statement is used to modify existing data within a table.
     ex--
UPDATE Employees
SET Department = Sales'
WHERE ID = 1;

iii.DELETE:-
       The DELETE statement is used to remove one or more rows of data from a table based on specified conditions.
    ex--
DELETE FROM Employees
WHERE Age > 40;

Q4. What is DQL? Explain SELECT with an example.

In [ ]:
Ans:-
    DQL stands for Data Query Language,which is used to retrive data from the database.
    
The SELECT statement is used to retrieve data from one or more tables in a database.
  ex---
SELECT ID, Name, Age, Department
FROM Employees
WHERE Department = 'Healthcare'
ORDER BY Name ASC;

Q5. Explain Primary Key and Foreign Key.

In [ ]:
Ans:-
    i.Primary Key :-
----->A primary key is a unique column we set ina table to easily identify & locate data in queries.
----->A table can have only one primary key,which should be unique & NOT NULL.

    ii.Forign Key:-
----->A foreign key is a column used to link two or more tables together.
----->A table can have any no. of foreifn key,can contain duplicate & NULL values.

Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

In [ ]:
As:-To connect Python to MySQL, you can use the mysql-connector-python library.

In [ ]:
pip install mysql-connector-python

In [ ]:
import mysql.connector

# Establish the connection
cnx = mysql.connector.connect(
    host="localhost",
    user="your_username",
    password="your_password",
    database="your_database"
)

# Create a cursor object
cursor = cnx.cursor()

# Execute a query
query = "SELECT * FROM Employees"
cursor.execute(query)

# Fetch the results
results = cursor.fetchall()

# Process the results
for row in results:
    print(row)

# Close the cursor and connection
cursor.close()
cnx.close()

In [ ]:
cursor():-
    In the code above, cursor = cnx.cursor() creates a cursor object. 
      The cursor allows you to execute SQL statements and retrieve results from the database.
        
execute():-
    The execute() method is used to execute an SQL query or statement.
      It takes the SQL query as a parameter and sends it to the MySQL server for execution.

Q7. Give the order of execution of SQL clauses in an SQL query.

In [ ]:
Ans:-
      i.From
       ii.Where
        iii.Group By
          iv.Having
            v.Select
             vi.Order By
                vi